src/DataProcessors/ОтправкаСообщенийРазработчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаСообщенийРазработчикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТемаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ОтправкаСообщенийРазработчикам/Forms/Форма/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИУИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()
	
	Если ПустаяСтрока(Подпись) Тогда
		Подпись = ВосстановитьЗначение("ПодписьСообщенияОтправкаСообщенияРазработчикам");
	КонецЕсли;
	
	Если ВидСообщения = 0 Тогда
		ВидСообщения = 2;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Обработчик события нажатия кнопки Выполнить КП.
//
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Почта = Новый Почта;
	
	Сообщение = Новый ПочтовоеСообщение;
	Сообщение.Получатели.Добавить(ЭлАдресРазработчика);
	
	Сообщение.Текст = СформироватьТекстИнформацииОСистеме() + СокрЛП(ТекстСообщения);
	Если Не ПустаяСтрока(Подпись) Тогда
		Сообщение.Текст = Сообщение.Текст + Символы.ПС + Символы.ПС + СокрЛП(Подпись);
	КонецЕсли;
	
	Сообщение.Тема = СформироватьПрефиксТемыСообщения() + ТемаСообщения;
	
	Состояние("Подключение к основной почтовой программе...");
	Попытка
		Почта.Подключиться();
	Исключение
		Сообщить("Не удалось подключиться к основной почтовой программе.");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Состояние("Отправка сообщения...");
	Попытка
		Почта.Послать(Сообщение);
	Исключение
		Сообщить("Не удалось отправить сообщение.");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;                  
	
	Предупреждение("Сообщение отправлено.",3);
	СохранитьЗначение("ПодписьСообщенияОтправкаСообщенияРазработчикам", Подпись);
	Закрыть();
	
КонецПроцедуры
